var productArr = [{
    "id": "1",
    "value": "家用电器",
	"brands":[{
		"id": "110101",
		"value": "美的"
	},{
		"id": "110102",
		"value": "格力"
	},{
		"id": "110203",
		"value": "西门子"
	}],
    "childs": [{
        "id": "11",
        "value": "冰箱",
		"brands":[{
			"id": "110101",
			"value": "美的"
		},{
			"id": "110102",
			"value": "格力"
		}],
        "childs": [{
            "id": "1101",
            "value": "对开门冰箱",
			"brands":[{
				"id": "110101",
				"value": "美的"
			},{
				"id": "110102",
				"value": "格力"
			}]
        },
        {
            "id": "1102",
            "value": "多开门冰箱",
			"brands":[{
				"id": "110201",
				"value": "美的"
			},{
				"id": "110202",
				"value": "格力"
			}]
        }]
    },
    {
        "id": "12",
        "value": "电视",
		"brands":[{
			"id": "110101",
			"value": "美的"
		},{
			"id": "110102",
			"value": "格力"
		},{
			"id": "110203",
			"value": "西门子"
		}],
        "childs": [{
            "id": "1201",
            "value": "曲面电视"
        },
        {
            "id": "1202",
            "value": "超薄电视"
        }]
    },
    {
        "id": "13",
        "value": "热水器",
		"brands":[{
			"id": "110101",
			"value": "美的"
		},{
			"id": "110102",
			"value": "格力"
		},{
			"id": "110203",
			"value": "西门子"
		}],
        "childs": [{
            "id": "1301",
            "value": "电热水器"
        },
        {
            "id": "1302",
            "value": "燃气热水器"
        }]
    }]
},{
    "id": "2",
    "value": "商业制冷",
	"brands":[{
		"id": "110101",
		"value": "美的"
	},{
		"id": "110102",
		"value": "格力"
	}],
    "childs": [{
        "id": "11",
        "value": "冰箱",
        "childs": [{
            "id": "1101",
            "value": "对开门冰箱",
			"brands":[{
				"id": "110101",
				"value": "美的"
			},{
				"id": "110102",
				"value": "格力"
			}]
        },
        {
            "id": "1102",
            "value": "多开门冰箱",
			"brands":[{
				"id": "110201",
				"value": "美的"
			},{
				"id": "110202",
				"value": "格力"
			},{
				"id": "110203",
				"value": "西门子"
			}]
        }]
    },
    {
        "id": "12",
        "value": "电视",
        "childs": [{
            "id": "1201",
            "value": "曲面电视"
        },
        {
            "id": "1202",
            "value": "超薄电视"
        }]
    },
    {
        "id": "13",
        "value": "热水器",
        "childs": [{
            "id": "1301",
            "value": "电热水器"
        },
        {
            "id": "1302",
            "value": "燃气热水器"
        }]
    }]
}];


